# Day 4 - Populating Database

---
## Objective

The objective of this task was to explore, clean, and prepare a raw SAT results dataset and load the resulting high-quality data into a PostgreSQL database.  
This included identifying and documenting data quality issues, applying deliberate and transparent data transformations, designing a clean and minimal schema, and implementing a reliable ETL workflow using Python.  
The final goal was to ensure that the data is consistent, reproducible, and database-ready.

---
## Import Libraries

In [ ]:
#Imports pandas for data manipulation and sqlalchemy for database connections and SQL operations

import pandas as pd 
import sqlalchemy as sa 
from sqlalchemy import create_engine

---
## Extract

---
### Import Data

In [ ]:
#Load raw SAT results data from the local CSV file

df = pd.read_csv("/Users/michael/Desktop/webeet.io/Onboarding/Day4/sat-results.csv")

In [ ]:
#Preserve raw state

df_raw = df.copy()

---
### Data Exploration

#### General Overview

In [ ]:
#Displays the shape of the DataFrame as (number of rows, number of columns)

df.shape

(493, 11)

In [ ]:
#Displays the column names of the DataFrame

df.columns

Index(['DBN', 'SCHOOL NAME', 'Num of SAT Test Takers',
       'SAT Critical Reading Avg. Score', 'SAT Math Avg. Score',
       'SAT Writing Avg. Score', 'SAT Critical Readng Avg. Score',
       'internal_school_id', 'contact_extension', 'pct_students_tested',
       'academic_tier_rating'],
      dtype='object')

In [ ]:
#Displays a concise summary of the directory DataFrame, including column names, data types, and non-null counts

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 11 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              493 non-null    object
 1   SCHOOL NAME                      493 non-null    object
 2   Num of SAT Test Takers           493 non-null    object
 3   SAT Critical Reading Avg. Score  493 non-null    object
 4   SAT Math Avg. Score              493 non-null    object
 5   SAT Writing Avg. Score           493 non-null    object
 6   SAT Critical Readng Avg. Score   493 non-null    object
 7   internal_school_id               493 non-null    int64
 8   contact_extension                388 non-null    object
 9   pct_students_tested              376 non-null    object
 10  academic_tier_rating             402 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 42.5+ KB

In [ ]:
#Displays the first ten rows of the directory DataFrame to quickly inspect its structure and contents

df.head(10)

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0
5,01M515,LOWER EAST SIDE PREPARATORY HIGH SCHOOL,112,332,557,316,332,414951,x345,NaN,3.0
6,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522,574,525,522,697107,NaN,78%,2.0
7,01M650,CASCADES HIGH SCHOOL,18,417,418,411,417,297600,NaN,92%,4.0
8,01M696,BARD HIGH SCHOOL EARLY COLLEGE,130,624,604,628,624,881396,x234,NaN,NaN
9,02M047,47 THE AMERICAN SIGN LANGUAGE AND ENGLISH SECO...,16,395,400,387,395,751293,NaN,78%,4.0

In [ ]:
#Displays a random sample of 10 rows from the DataFrame for spot-checking

df.sample(10, random_state= 42)

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
454,31R450,CURTIS HIGH SCHOOL,375,437,435,429,437,315495,x234,92%,4.0
73,02M655,LIFE SCIENCES SECONDARY SCHOOL,61,409,424,403,409,885497,x345,92%,2.0
310,17K548,BROOKLYN SCHOOL FOR MUSIC & THEATRE,48,385,393,373,385,932462,NaN,78%,1.0
175,09X505,"BRONX SCHOOL FOR LAW, GOVERNMENT AND JUSTICE",80,404,418,402,404,568598,x345,NaN,4.0
332,19K431,THOMAS JEFFERSON YABC,s,s,s,s,s,194950,x345,92%,2.0
204,10X660,GRACE DODGE CAREER AND TECHNICAL EDUCATION HIG...,73,362,382,356,362,370212,NaN,85%,NaN
155,08X560,HIGH SCHOOL X560 s BRONX ACADEMY HIGH SCHOOL,9,404,368,399,404,906309,x234,78%,2.0
55,02M542,MANHATTAN BRIDGES HIGH SCHOOL,66,336,378,344,336,794996,x123,85%,NaN
320,18K576,VICTORY COLLEGIATE HIGH SCHOOL,63,387,377,379,387,412625,x234,85%,3.0
9,02M047,47 THE AMERICAN SIGN LANGUAGE AND ENGLISH SECO...,16,395,400,387,395,751293,NaN,78%,4.0

#### Column Inspection: "DBN"

In [ ]:
#Defines a regular expression pattern that matches the expected DBN format:
#two digits, followed by one uppercase letter, followed by three digits (e.g., 02M419)

pattern = r"^\d{2}[A-Z]\d{3}$"


#Identifies rows where the DBN value does NOT match the expected format
#The DBN column is cast to string to ensure consistent pattern matching
#The tilde (~) operator inverts the boolean mask, selecting invalid entries

invalid_dbn = df[
    ~df["DBN"].astype(str).str.match(pattern, na=False)
]


#Displays the first 25 DBN values that do not conform to the expected format

invalid_dbn[["DBN"]].head(25)

               DBN
354  21K412/21K411

In [ ]:
#Flags DBN entries that contain multiple identifiers by detecting a slash ("/") in the DBN value

df["dbn_has_multiple_ids"] = (
    df["DBN"]
      .astype(str)
      .str.contains("/", na=False)
)

#Displays all rows where the DBN field contains multiple identifiers

df[df["dbn_has_multiple_ids"]]

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating,dbn_has_multiple_ids
354,21K412/21K411,ABRAHAM LINCOLN YABC/LEARNING TO WORK GED AT A...,s,s,s,s,s,411797,x123,78%,4.0,True

#### Column Inspection: "SCHOOL NAME"

In [ ]:
#Inspect SCHOOL NAME column

df["SCHOOL NAME"].head(10)

#Count missing values

df["SCHOOL NAME"].isna().sum()

#Check for empty or whitespace-only names

(df["SCHOOL NAME"].astype(str).str.strip() == "").sum()

np.int64(0)

In [ ]:
#Flags rows where the school name is missing, empty, or consists only of whitespace

df["school_name_is_missing"] = (
    df["SCHOOL NAME"].isna()
    | df["SCHOOL NAME"].astype(str).str.strip().eq("")
)

#Displays all rows with missing or empty school names

df[df["school_name_is_missing"]]

Empty DataFrame
Columns: [DBN, SCHOOL NAME, Num of SAT Test Takers, SAT Critical Reading Avg. Score, SAT Math Avg. Score, SAT Writing Avg. Score, SAT Critical Readng Avg. Score, internal_school_id, contact_extension, pct_students_tested, academic_tier_rating, dbn_has_multiple_ids, school_name_is_missing]
Index: []

#### Column Inspection: "pct_students_tested"

In [ ]:
#Displays the frequency of each unique value in the pct_students_tested column, including missing values

df["pct_students_tested"].value_counts(dropna=False)

#Counts the number of entries explicitly labeled as "N/A" in the pct_students_tested column

(df["pct_students_tested"] == "N/A").sum()

np.int64(0)

In [ ]:
#Flags rows where pct_students_tested is missing, marked as "N/A", or does not follow a valid percentage format (e.g., "92%")

df["pct_students_tested_is_invalid"] = (
    df["pct_students_tested"].isna()
    | df["pct_students_tested"].eq("N/A")
    | ~df["pct_students_tested"].astype(str).str.match(r"^\d+%$", na=False)
)

#Displays all rows with invalid or non-standard percentage values

df[df["pct_students_tested_is_invalid"]]

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating,dbn_has_multiple_ids,school_name_is_missing,pct_students_tested_is_invalid
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0,False,False,True
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0,False,False,True
5,01M515,LOWER EAST SIDE PREPARATORY HIGH SCHOOL,112,332,557,316,332,414951,x345,NaN,3.0,False,False,True
8,01M696,BARD HIGH SCHOOL EARLY COLLEGE,130,624,604,628,624,881396,x234,NaN,NaN,False,False,True
15,02M303,"FACING HISTORY SCHOOL, THE",76,353,358,340,353,612918,NaN,NaN,NaN,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
465,32K554,ALL CITY LEADERSHIP SECONDARY SCHOOL,39,428,465,422,428,587220,NaN,NaN,2.0,False,False,True
469,75M035,P.S. 035,s,s,s,s,s,861847,x123,NaN,4.0,False,False,True
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,s,s,s,s,s,976034,x345,NaN,4.0,False,False,True
479,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,406,937579,x234,NaN,NaN,False,False,True
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,406,937579,x234,NaN,NaN,False,False,True

#### Column Inspection: "SAT ... Score"

In [ ]:
#Defines a list of SAT score columns to be inspected together, as they share the same semantics, data type expectations, and validation rules

sat_score_cols = [
    "SAT Critical Reading Avg. Score",
    "SAT Math Avg. Score",
    "SAT Writing Avg. Score",
    "SAT Critical Readng Avg. Score"
]

In [ ]:
#Displays data types and non-null counts for all SAT score columns

df[sat_score_cols].info()

#Counts missing values for each SAT score column

df[sat_score_cols].isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 4 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   SAT Critical Reading Avg. Score  493 non-null    object
 1   SAT Math Avg. Score              493 non-null    object
 2   SAT Writing Avg. Score           493 non-null    object
 3   SAT Critical Readng Avg. Score   493 non-null    object
dtypes: object(4)
memory usage: 15.5+ KB

SAT Critical Reading Avg. Score    0
SAT Math Avg. Score                0
SAT Writing Avg. Score             0
SAT Critical Readng Avg. Score     0
dtype: int64

In [ ]:
#Iterates over each SAT score column to identify and display non-numeric values

for col in sat_score_cols:
    
    #Creates a boolean mask for values that cannot be converted to numeric but are not missing
    
    non_numeric_mask = pd.to_numeric(df[col], errors="coerce").isna() & df[col].notna()
    
    #Prints the column name currently being inspected

    print(col)

    #Displays the frequency of non-numeric values found in the column

    print(df.loc[non_numeric_mask, col].value_counts())

    #Prints a separator for readability between columns

    print("-" * 40)

SAT Critical Reading Avg. Score
SAT Critical Reading Avg. Score
s    58
Name: count, dtype: int64
----------------------------------------
SAT Math Avg. Score
SAT Math Avg. Score
s    58
Name: count, dtype: int64
----------------------------------------
SAT Writing Avg. Score
SAT Writing Avg. Score
s    58
Name: count, dtype: int64
----------------------------------------
SAT Critical Readng Avg. Score
SAT Critical Readng Avg. Score
s    58
Name: count, dtype: int64
----------------------------------------

In [ ]:
#Iterates over each SAT score column to identify values outside the valid SAT score range (200â€“800)

for col in sat_score_cols:
    
    #Converts column values to numeric, coercing invalid entries to NaN for safe comparison

    numeric_values = pd.to_numeric(df[col], errors="coerce")

    #Selects values that fall below 200 or above 800

    out_of_range = numeric_values[(numeric_values < 200) | (numeric_values > 800)]
    
    #Prints the column name currently being inspected

    print(col)

    #Displays the frequency of out-of-range values for the column

    print(out_of_range.value_counts())

    #Prints a separator for readability between columns
    
    print("-" * 40)

SAT Critical Reading Avg. Score
Series([], Name: count, dtype: int64)
----------------------------------------
SAT Math Avg. Score
SAT Math Avg. Score
 999.0     2
 850.0     1
-10.0      1
 1100.0    1
Name: count, dtype: int64
----------------------------------------
SAT Writing Avg. Score
Series([], Name: count, dtype: int64)
----------------------------------------
SAT Critical Readng Avg. Score
Series([], Name: count, dtype: int64)
----------------------------------------

---
## Transform


#### Column normalization

In [ ]:
#Normalizes column names by trimming whitespace, converting to lowercase, replacing non-alphanumeric characters with underscores,
#Collapsing multiple underscores into a single underscore, and removing leading or trailing underscores

df.columns = (
    df.columns
      .str.strip()
      .str.lower()
      .str.replace(r"[^a-z0-9]+", "_", regex=True)
      .str.replace(r"_+", "_", regex=True)
      .str.strip("_")
)

#Displays the normalized column names

df.columns

Index(['dbn', 'school_name', 'num_of_sat_test_takers',
       'sat_critical_reading_avg_score', 'sat_math_avg_score',
       'sat_writing_avg_score', 'sat_critical_readng_avg_score',
       'internal_school_id', 'contact_extension', 'pct_students_tested',
       'academic_tier_rating', 'dbn_has_multiple_ids',
       'school_name_is_missing', 'pct_students_tested_is_invalid'],
      dtype='object')

In [ ]:
# Drop unrelated, redundant, or non-analytical fields

df = df.drop(
    columns=[
        "sat_critical_readng_avg_score",  # Typo variant of reading score, redundant
        "internal_school_id",             # Internal/synthetic identifier
        "contact_extension",              # Administrative metadata
        "academic_tier_rating"            # Derived rating, unclear calculation
    ],
    errors="ignore"  # Ensures pipeline robustness if columns are missing
)

In [ ]:
#Displays the column names of the DataFrame as a Python list

df.columns.tolist()

['dbn',
 'school_name',
 'num_of_sat_test_takers',
 'sat_critical_reading_avg_score',
 'sat_math_avg_score',
 'sat_writing_avg_score',
 'pct_students_tested',
 'dbn_has_multiple_ids',
 'school_name_is_missing',
 'pct_students_tested_is_invalid']

#### Duplicates

In [ ]:
#Counts the number of fully duplicated rows in the DataFrame

df.duplicated().sum()

#Displays the first few rows that are exact duplicates of previous rows

df[df.duplicated()].head()

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,pct_students_tested,dbn_has_multiple_ids,school_name_is_missing,pct_students_tested_is_invalid
478,14K685,EL PUENTE ACADEMY FOR PEACE AND JUSTICE,28,359,335,341,92%,False,False,False
479,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,NaN,False,False,True
480,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,92%,False,False,False
481,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,92%,False,False,False
482,19K420,FRANKLIN K. LANE HIGH SCHOOL,s,s,s,s,78%,False,False,False

In [ ]:
#Displays all rows that are part of duplicate groups by marking both original and duplicate entries,
#then sorts them by all columns to group identical rows together for easier inspection

df[df.duplicated(keep=False)].sort_values(by=df.columns.tolist()).head(100)

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,pct_students_tested,dbn_has_multiple_ids,school_name_is_missing,pct_students_tested_is_invalid
35,02M419,LANDMARK HIGH SCHOOL,62,390,399,381,78%,False,False,False
486,02M419,LANDMARK HIGH SCHOOL,62,390,399,381,78%,False,False,False
52,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,92%,False,False,False
484,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,92%,False,False,False
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,92%,False,False,False
99,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,78%,False,False,False
487,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,78%,False,False,False
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,78%,False,False,False
119,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,92%,False,False,False
481,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,92%,False,False,False
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,92%,False,False,False
177,09X525,BRONX LEADERSHIP ACADEMY HIGH SCHOOL,114,384,394,388,92%,False,False,False
483,09X525,BRONX LEADERSHIP ACADEMY HIGH SCHOOL,114,384,394,388,92%,False,False,False
258,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,NaN,False,False,True
479,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,NaN,False,False,True
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,NaN,False,False,True
276,14K685,EL PUENTE ACADEMY FOR PEACE AND JUSTICE,28,359,335,341,92%,False,False,False
478,14K685,EL PUENTE ACADEMY FOR PEACE AND JUSTICE,28,359,335,341,92%,False,False,False
306,17K543,"SCIENCE, TECHNOLOGY AND RESEARCH EARLY COLLEGE...",69,457,462,441,85%,False,False,False
485,17K543,"SCIENCE, TECHNOLOGY AND RESEARCH EARLY COLLEGE...",69,457,462,441,85%,False,False,False
331,19K420,FRANKLIN K. LANE HIGH SCHOOL,s,s,s,s,78%,False,False,False
482,19K420,FRANKLIN K. LANE HIGH SCHOOL,s,s,s,s,78%,False,False,False
414,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,92%,False,False,False
480,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,92%,False,False,False
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,92%,False,False,False

In [ ]:
#Creates a boolean mask identifying all rows that are part of duplicate groups,
#including both the original rows and their duplicates

mask = df.duplicated(keep=False)

#Extracts all rows that belong to duplicate groups using the boolean mask

df_dups = df[mask]

#Displays the total number of rows that are part of duplicate groups

df_dups.shape[0]

25

In [ ]:
#Displays the total number of rows that are part of duplicate groups

df_dups.groupby(df.columns.tolist()).size().sort_values(ascending=False).head(30)

dbn     school_name                                                            num_of_sat_test_takers  sat_critical_reading_avg_score  sat_math_avg_score  sat_writing_avg_score  pct_students_tested  dbn_has_multiple_ids  school_name_is_missing  pct_students_tested_is_invalid
02M520  MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS                       264                     407                             440                 393                    92%                  False                 False                   False                             3
05M304  MOTT HALL HIGH SCHOOL                                                  54                      413                             399                 398                    78%                  False                 False                   False                             3
07X221  SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL                        65                      364                             378                 348                    92%                  False                 False                   False                             3
27Q480  JOHN ADAMS HIGH SCHOOL                                                 403                     391                             409                 392                    92%                  False                 False                   False                             3
02M419  LANDMARK HIGH SCHOOL                                                   62                      390                             399                 381                    78%                  False                 False                   False                             2
09X525  BRONX LEADERSHIP ACADEMY HIGH SCHOOL                                   114                     384                             394                 388                    92%                  False                 False                   False                             2
14K685  EL PUENTE ACADEMY FOR PEACE AND JUSTICE                                28                      359                             335                 341                    92%                  False                 False                   False                             2
17K543  SCIENCE, TECHNOLOGY AND RESEARCH EARLY COLLEGE HIGH SCHOOL AT ERASMUS  69                      457                             462                 441                    85%                  False                 False                   False                             2
19K420  FRANKLIN K. LANE HIGH SCHOOL                                           s                       s                               s                   s                      78%                  False                 False                   False                             2
dtype: int64

In [ ]:
#Removes duplicate rows from the DataFrame while keeping the first occurrence of each duplicate group

df = df.drop_duplicates(keep="first")

In [ ]:
#Counts the number of remaining duplicated rows in the DataFrame after duplicate removal

df.duplicated().sum()

np.int64(0)

#### Inconsistent formatting

##### Data Cleansing: "pct_students_tested"

In [ ]:
#Normalizes the pct_students_tested column by handling placeholder values and standardizing string formatting

df["pct_students_tested"] = (
    df["pct_students_tested"]
      .replace("N/A", pd.NA)
      .astype(str)
      .str.strip()
)

#Removes a trailing percent sign from percentage values, if present

df["pct_students_tested"] = df["pct_students_tested"].str.rstrip("%")

#Converts the cleaned percentage values to numeric, coercing invalid entries to NaN

df["pct_students_tested"] = pd.to_numeric(df["pct_students_tested"], errors="coerce")

##### Data Cleansing: "num_of_sat_test_takers"

In [ ]:
#Converts the num_of_sat_test_takers column to numeric, coercing non-numeric values (e.g., "s") to NaN

df["num_of_sat_test_takers"] = pd.to_numeric(
    df["num_of_sat_test_takers"],
    errors="coerce"
)

#### Invalid SAT scores

In [ ]:
#Defines the list of cleaned SAT score columns to be validated and processed together

score_cols = [
    "sat_critical_reading_avg_score",
    "sat_math_avg_score",
    "sat_writing_avg_score"
]

In [ ]:
#Converts each SAT score column to numeric, coercing invalid values to NaN

for col in score_cols:
    df[col] = pd.to_numeric(df[col], errors="coerce")

In [ ]:
#Checks each SAT score column for values outside the valid range (200â€“800) and reports the number of invalid entries

for col in score_cols:
    invalid_mask = ~df[col].between(200, 800) & df[col].notna()
    invalid_count = invalid_mask.sum()
    print(f"{col}: {invalid_count} invalid values")

sat_critical_reading_avg_score: 0 invalid values
sat_math_avg_score: 5 invalid values
sat_writing_avg_score: 0 invalid values

In [ ]:
#Replaces SAT score values outside the valid range (200â€“800) with NaN for each score column

for col in score_cols:
    df.loc[~df[col].between(200, 800), col] = pd.NA

In [ ]:
#Displays descriptive statistics for the SAT score columns, including count, mean, standard deviation, and value ranges

df[score_cols].describe()

,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score
count,421.000000,416.000000,421.000000
mean,400.850356,413.733173,393.985748
std,56.802783,64.945638,58.635109
min,279.000000,312.000000,286.000000
25%,368.000000,372.000000,360.000000
50%,391.000000,395.000000,381.000000
75%,416.000000,437.250000,411.000000
max,679.000000,735.000000,682.000000

---
### Data Sanity Checks

In [ ]:
#Displays descriptive statistics for the SAT score columns to verify value ranges and distributions

df[score_cols].describe()

#Displays descriptive statistics for the pct_students_tested column as a sanity check without applying additional fixes

df["pct_students_tested"].describe()

#Displays the columns with the highest number of missing values for a high-level data completeness overview

df.isna().sum().sort_values(ascending=False).head(20)

pct_students_tested               115
sat_math_avg_score                 62
num_of_sat_test_takers             57
sat_critical_reading_avg_score     57
sat_writing_avg_score              57
dbn                                 0
school_name                         0
dbn_has_multiple_ids                0
school_name_is_missing              0
pct_students_tested_is_invalid      0
dtype: int64

In [ ]:
#Removes exploratory quality-check flag columns that are not intended to be persisted in the final dataset

df = df.drop(
    columns=[
        "dbn_has_multiple_ids",
        "school_name_is_missing",
        "pct_students_tested_is_invalid",
    ],
    errors="ignore"
)

In [ ]:
#Displays the final list of column names after all transformations and cleanup steps

df.columns.tolist()

['dbn',
 'school_name',
 'num_of_sat_test_takers',
 'sat_critical_reading_avg_score',
 'sat_math_avg_score',
 'sat_writing_avg_score',
 'pct_students_tested']

In [ ]:
#Validates that each SAT score column contains only values within the valid range (200â€“800) or missing values,
#and raises an assertion error if any invalid values remain

for col in score_cols:
    invalid = df[col][~(df[col].between(200, 800) | df[col].isna())]
    assert invalid.empty, f"{col} has invalid values: {invalid.unique()}"

In [ ]:
#Validates that pct_students_tested contains only values between 0 and 100 or missing values

assert (
    df["pct_students_tested"].between(0, 100)
    | df["pct_students_tested"].isna()
).all()

In [ ]:
#Validates that no duplicate rows remain in the DataFrame after the deduplication step

assert df.duplicated().sum() == 0

In [ ]:
#Displays the total number of rows in the DataFrame after all transformations and validations

print("rows:", len(df))

rows: 478

In [ ]:
#Displays a random sample of 10 rows from the final DataFrame for a last spot-check before loading

df.sample(10, random_state= 33)

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,pct_students_tested
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,78.0
383,24Q530,INTERNATIONAL HIGH SCHOOL AT LAGUARDIA COMMUNI...,69.0,326.0,409.0,329.0,92.0
417,28Q310,QUEENS COLLEGIATE: A COLLEGE BOARD SCHOOL,68.0,420.0,445.0,400.0,78.0
193,10X437,FORDHAM HIGH SCHOOL FOR THE ARTS,48.0,355.0,350.0,372.0,85.0
355,21K468,KINGSBOROUGH EARLY COLLEGE SCHOOL,NaN,NaN,NaN,NaN,78.0
267,14K474,PROGRESS HIGH SCHOOL FOR PROFESSIONAL CAREERS,144.0,364.0,379.0,371.0,78.0
76,03M307,"URBAN ASSEMBLY SCHOOL FOR MEDIA STUDIES, THE",41.0,384.0,390.0,370.0,78.0
260,13K670,BENJAMIN BANNEKER ACADEMY,185.0,471.0,472.0,448.0,NaN
42,02M439,MANHATTAN VILLAGE ACADEMY,95.0,441.0,473.0,458.0,85.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,NaN,NaN,NaN,NaN,NaN

---
## Load

---
### Database Connection

In [43]:
#Defines the database connection URL for accessing a PostgreSQL database with SSL enabled

db_url = 'postgresql://neondb_owner:a9Am7Yy5r9_T7h4OF2GN@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech:5432/neondb?sslmode=require'

In [ ]:
#Sets up the database infrastructure by initializing the engine and establishing a connection

engine = create_engine(db_url, pool_pre_ping=True)

In [ ]:
#Executes a simple test query to verify that the database connection is working

with engine.connect() as conn:
    conn.execute(sa.text("SELECT 1"))

In [ ]:
#Defines the final set of columns to be loaded into the database

final_cols = [
    "dbn",
    "school_name",
    "num_of_sat_test_takers",
    "sat_critical_reading_avg_score",
    "sat_math_avg_score",
    "sat_writing_avg_score",
    "pct_students_tested",
]

#Creates a copy of the DataFrame containing only the final columns selected for database insertion

df_load = df[final_cols].copy()

In [ ]:
#Writes the cleaned and validated DataFrame to the PostgreSQL database,
#creating the table if it does not exist and appending the data within a transactional context

with engine.begin() as conn:
    df_load.to_sql(
        name="michael_kloess_sat_scores",
        con=conn,
        schema="nyc_schools",
        if_exists="append",
        index=False,
        method="multi"
    )

### Quality-Check

In [ ]:
#Queries the database to count the number of rows in the target table after data insertion

with engine.connect() as conn:
    count = conn.execute(
        sa.text("SELECT COUNT(*) FROM nyc_schools.michael_kloess_sat_scores")
    ).scalar()

#Displays the total number of rows currently stored in the database table

print("rows_in_table:", count)

rows_in_table: 478

### Create .csv

In [49]:
#Exports the cleaned and fully transformed DataFrame to a CSV file

df.to_csv("cleaned_sat_results.csv", index=False)